eldoradoel/STM32-Balance-Car/User/upstandingcar.c

#include "upstandingcar.h"
#include "I2C_MPU6050.h"
#include "MOTOR.h"
#include "led.h"
#include "USART.H"
#include "MPU6050.H"
#include "UltrasonicWave.h"
#include "stm32f10x_gpio.h"
#include "math.h"
#include <string.h>
#include <stdlib.h>
#include <stdio.h>
#include "adc.h"

/*****************************************/
u8 newLineReceived = 0;
u8 inputString[80] = {0};

u8 ProtocolString[80] = {0};
/*小车运行状态枚举*/
enum
{
	enSTOP = 0,
	enRUN,
	enBACK,
	enLEFT,
	enRIGHT,
	enTLEFT,
	enTRIGHT
} enCarState;

#define run_car '1'	  //按键前
#define back_car '2'  //按键后
#define left_car '3'  //按键左
#define right_car '4' //按键右
#define stop_car '0'  //按键停

int g_newcarstate = enSTOP; //  1前2后3左4右0停止

int Direction;
char returntemp[] = "$0,0,0,0,0,0,0,0,0,0,0,0cm,8.2V#";
char piddisplay[50] = "$AP";
char manydisplay[80] = {0};
char updata[80] = {0};

/*****************多数据************************/

u8 BST_u8MainEventCount;	//主循环判断计数  在SysTick_Handler(void)中使用 每1ms加1
u8 BST_u8SpeedControlCount; //速度控制循环计数  在SysTick_Handler(void)中使用 每5ms加1
u8 BST_u8SpeedControlPeriod;
u8 BST_u8DirectionControlPeriod;
u8 BST_u8DirectionControlCount; //转向控制循环计数  在SysTick_Handler(void)中使用 每5ms加1
u8 BST_u8trig;
u8 BST_uart1flag;
u8 ucBluetoothValue; //蓝牙接收数据
int BST_speedtime;
int Speedset = 100;
float volt = 12.0;

/******电机控制参数******/
float BST_fSpeedControlOut; //速度控制PWM
float BST_fSpeedControlOutOld;
float BST_fSpeedControlOutNew;
float BST_fAngleControlOut;
float BST_fLeftMotorOut;
float BST_fRightMotorOut;

float BST_fCarAngle; //角度控制PWM
float gyro_z;
float gyrx;
float gy0;

// float BST_fCarAngle_P = 135.0;
// float BST_fCarAngle_D = 0.3;

// float BST_fCarSpeed_P = 8.0;
// float BST_fCarSpeed_I = 0.3;

float BST_fCarAngle_P = 110.0;
float BST_fCarAngle_D = 0.25;

float BST_fCarSpeed_P = 5.1;
float BST_fCarSpeed_I = 0.1;

const double PID_Original[4] = {91.3, 0.21, 5.00, 0.100};
char alldata[80];
char *iap;

/******速度控制参数******/
s16 BST_s16LeftMotorPulse;	//左电机脉冲数
s16 BST_s16RightMotorPulse; //右电机脉冲数

s32 BST_s32LeftMotorPulseOld;
s32 BST_s32RightMotorPulseOld;
s32 BST_s32LeftMotorPulseSigma;	 // 50ms左电机叠加值
s32 BST_s32RightMotorPulseSigma; // 50ms右电机叠加值

float BST_fCarSpeed; //测速码盘得出的车速
float BST_fCarSpeedOld;

float BST_fCarPosition; //测速码盘通过计算得到的小车位移

/*-----悬停参数-----*/
int leftstop = 0;
int rightstop = 0;
int stopflag = 0;

/******超声波********/

float fchaoshengbo = 0; //超声波输出量
float juli = 0;			//超声波距离

/******蓝牙控制参数******/
float BST_fBluetoothSpeed;		  //蓝牙控制车速
float BST_fBluetoothDirectionNew; //用于平缓输出车速使用
float BST_fBluetoothDirectionSL;  //左转标志位  由于PWM转向输出使用判断输出方式 固需要标志位
float BST_fBluetoothDirectionSR;  //右转标志位	  由于PWM转向输出使用判断输出方式 固需要标志位
int chaoflag = 0;
int x, y1, z1, y2, z2, flagbt;
int g_autoup = 0;
int g_uptimes = 5000; //自动上报间隔
char charkp[10], charkd[10], charksp[10], charksi[10];
char lspeed[10], rspeed[10], daccel[10], dgyro[10], csb[10], vi[10];
char kp, kd, ksp, ksi;
float dac = 0, dgy = 0;

/************旋转*****************/
float BST_fBluetoothDirectionL; //左旋转标志位  由于PWM旋转输出使用判断输出方式 固需要标志位
float BST_fBluetoothDirectionR; //右旋转标志位  由于PWM旋转输出使用判断输出方式 固需要标志位
int driectionxco = 150;

/************循迹**************/
float Tracing_Speed;
float Tracing_Direction;
int Tracing_Count;
int Tracing_CountPoor;
//控制小车正方形运动
float MPU6050_Zero;
float SquareLastAngle;
float DebugControlCarDoDemoGetDiffAngle;
uint32_t Tracing_MPU6050Count;
uint8_t SquareEnable;
uint8_t SquareCountEnable;
uint8_t SquareStraight;
uint8_t SquareTurn;
uint8_t SquareReadyToTurn;
uint8_t SquareReadyToStraight;
// float DebugControlCarDoDemoGetDiffAngle;

//******卡尔曼参数************

float Q_angle = 0.001;
float Q_gyro = 0.003;
float R_angle = 0.5;
float dt = 0.005; // dt为kalman滤波器采样时间;
char C_0 = 1;
float Q_bias, Angle_err;
float PCt_0 = 0, PCt_1 = 0, E = 0;
float K_0 = 0, K_1 = 0, t_0 = 0, t_1 = 0;
float Pdot[4] = {0, 0, 0, 0};
float PP[2][2] = {{1, 0}, {0, 1}};

void SendAutoUp(void);

/**********延时子函数****************/
void delay_nms(u16 time)
{
	u16 i = 0;
	while (time--)
	{
		i = 12000; //自己定义
		while (i--)
			;
	}
}
/***********************************/

/***************************************************************
** 函数名称: CarUpstandInit
** 功能描述: 全局变量初始化函数

***************************************************************/
void CarUpstandInit(void)
{

	BST_s16LeftMotorPulse = BST_s16RightMotorPulse = 0;			  //左右脉冲值   初始化
	BST_s32LeftMotorPulseSigma = BST_s32RightMotorPulseSigma = 0; //叠加脉冲数	 初始化

	BST_fCarSpeed = BST_fCarSpeedOld = 0; //平衡小车车速	初始化
	BST_fCarPosition = 0;				  //平衡小车位移量	初始化
	BST_fCarAngle = 0;					  //平衡小车车速	初始化

	BST_fAngleControlOut = BST_fSpeedControlOut = BST_fBluetoothDirectionNew = 0; //角度PWM、车速PWM、蓝牙控制PWM	 初始化
	BST_fLeftMotorOut = BST_fRightMotorOut = 0;									  //左右车轮PWM输出值 			 初始化
	BST_fBluetoothSpeed = 0;													  //蓝牙控制车速值                 初始化
	BST_fBluetoothDirectionL = BST_fBluetoothDirectionR = 0;					  //蓝牙控制左右旋转标志位         初始化
	BST_fBluetoothDirectionSL = BST_fBluetoothDirectionSR = 0;					  //蓝牙控制左右转向标志位         初始化

	BST_u8MainEventCount = 0;	  //用于5ms定时器子程序SysTick_Handler(void)中总中断计数位
	BST_u8SpeedControlCount = 0;  //用于5ms定时器子程序SysTick_Handler(void)中50ms速度平衡融入计数位
	BST_u8SpeedControlPeriod = 0; //用于5ms定时器子程序SysTick_Handler(void)中50ms速度平衡融入计数位

	fchaoshengbo = 0; //用于5ms定时器子程序SysTick_Handler(void)中超声波平衡融入计数位
}

void ResetPID()
{
	if (BST_fCarAngle_P != PID_Original[0])
	{
		BST_fCarAngle_P = PID_Original[0];
	}
	if (BST_fCarAngle_D != PID_Original[1])
	{
		BST_fCarAngle_D = PID_Original[1];
	}
	if (BST_fCarSpeed_P != PID_Original[2])
	{
		BST_fCarSpeed_P = PID_Original[2];
	}
	if (BST_fCarSpeed_I != PID_Original[3])
	{
		BST_fCarSpeed_I = PID_Original[3];
	}
}

/***************************************************************
** 函数名称: AngleControl
** 功能描述: 角度环控制函数

***************************************************************/
void AngleControl(void)
{
	if (flagbt == 1)
	{
		BST_fCarAngle_P = 0;
		BST_fCarAngle_P = y1 * 1.71875;
	}
	if (flagbt == 2)
	{
		BST_fCarAngle_D = 0;
		BST_fCarAngle_D = (z1 - 64) * 0.15625;
	}
	dac = accel[2];
	dgy = gyro[2];
	if (Pitch == 0 || Pitch < -20 || Pitch > 20) // MPU6050状态指示灯 STM32核心板 PC13 绿色灯亮起为不正常
	{
		// Pitch=1;
		GPIO_ResetBits(GPIOC, GPIO_Pin_13); // MPU6050状态指示灯 STM32核心板 PC13 绿色灯亮起为不正常
	}
	else
	{
		GPIO_SetBits(GPIOC, GPIO_Pin_13);
	} // MPU6050状态正常时LED灯熄灭

	BST_fCarAngle = Roll - CAR_ZERO_ANGLE;												// DMP ROLL滚动方向角度与预设小车倾斜角度值的差得出角度
	BST_fAngleControlOut = BST_fCarAngle * BST_fCarAngle_P + gyro[0] * BST_fCarAngle_D; //角度PD控制
}

/***************************************************************
** 函数名称: SetMotorVoltageAndDirection
** 功能描述: 电机转速

